Repository: Bukk94/PrintServiceLibrary
Catalog: Properties/Localization.*.resx
Languages: cs_cz

# EmptyPrintCommands
source: Print commands are empty. Nothing to print.
cs_cz: Tiskové příkazy jsou prázdné.

source: Error
cs_cz: Chyba

# ErrorConnectToDesignatedPrinter
source: Can't connect to a designated printer
cs_cz: Nelze se připojit k vybrané tiskárně

source: Error occured
cs_cz: Nastala chyba

# ErrorOccuredDuringPrinting
source: Error occured during printing. Error code
cs_cz: Nastala chyba během tisku. Chybový kód

# ErrorReadPrinterAttempt
source: Error while attempting to read printer data
cs_cz: Nastala chyba při čtení dat tiskárny

# InvalidSerialData
source: Serial Port Name, Baud Rate or Data Bits are in invalid format
cs_cz: Název sériového portu, přenosová rychlost nebo datové bity jsou v neplatném formátu

# InvalidStopBits
source: Value None is not valid for Stop Bit parameters
cs_cz: Hodnota None není platná pro Stop Bity

source: IO Exception
cs_cz: Vstupní/výstupní chyba

source: No command to execute
cs_cz: Žádný příkaz k provedení

# NoIpAddressOrPort
source: IP Address or Network Port is not specified
cs_cz: IP adresa nebo síťový port není zadán

source: No USB Printer Found
cs_cz: Zadaná USB tiskárna nebyla nalezena

source: No XML template
cs_cz: Žádná šablona XML

# PritnerNameEmpty
source: Printer name is empty!
cs_cz: Nebyl zadán název tiskárny

source: Read Error
cs_cz: Chyba čtení

# ReadRequestTimeOut
source: Read request timed-out
cs_cz: Žádost o čtení tiskárny vypršela

source: Write Error
cs_cz: Chyba zápisu

# AccessRegistryKey
source: Couldn't access a specific registry key
cs_cz: Nelze získat přístup k určitému klíči registru

source: Error message
cs_cz: Chybová zpráva

source: Invalid LPT port name
cs_cz: Neplatný název LPT portu

# PrintError
source: Error printing document
cs_cz: Nastala chyba při tisku

# ZebraConnectionFailed
source: Zebra printer connection failed
cs_cz: Selhalo připojení k tiskárně Zebra

source: Binding failure
cs_cz: Selhání vázání dat

# CannotBindToEmptyTemplate
source: Cannot bind to empty {0} template
cs_cz: Nelze vázat data na prázdnou {0} šablonu

source: Cannot bind to empty ZPL template
cs_cz: Nelze vázat data na prázdnou ZPL šablonu

source: Cannot deserialize empty JSON
cs_cz: Nelze deserializovat prázdný JSON

# DataSourceIsNull
source: Data source is missing
cs_cz: Chybí zdroj dat

source: Empty Query
cs_cz: Prázdný dotaz

source: Invalid connection string
cs_cz: Neplatný databázový connection string

# InvalidZPL
source: Invalid ZPL structure. ZPL must start with ^XA and ends with ^XZ
cs_cz: Neplatná struktura ZPL. ZPL musí začínat ^XA a končit ^XZ

# JsonParsingError
source: An error occurred while parsing JSON. Maybe incorrect JSON format?
cs_cz: Během analýzy JSON došlo k chybě. Možná je nesprávný formát JSON?

# MissingDBSetting
source: Selected Database source is missing DB Settings structure!
cs_cz: Zvolenému databázovému zdoji chybí struktura s údaji (DB Settings)!

# SourceContainsMoreFields
source: Source contains more binding fields than data values
cs_cz: Zdroj obsahuje víc položek pro vázání dat než je datových položek

# SourceOrDataMissing
source: Source or Data is missing
cs_cz: Zdroj nebo data chybí

# MissingDBSettingStructure
source: Selected Database source is missing DB Settings structure!
cs_cz: Vybraný zdroj (databáze) nemá v datech DB Settings strukturu!

source: Invalid XML
cs_cz: XML není validní
